; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	thermograph0 - mode
	image1 - mode
	image6 - mode
	thermograph5 - mode
	spectrograph7 - mode
	image3 - mode
	spectrograph4 - mode
	spectrograph2 - mode
	Star0 - direction
	Star4 - direction
	Star5 - direction
	Star2 - direction
	GroundStation3 - direction
	Star1 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph5)
	(calibration_target instrument0 Star2)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 thermograph5)
	(supports instrument2 spectrograph7)
	(supports instrument2 image1)
	(calibration_target instrument2 Star5)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph5)
	(supports instrument4 image1)
	(supports instrument4 image3)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument5 image1)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 spectrograph2)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 spectrograph4)
	(supports instrument7 image6)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite1 GroundStation3)
	(pointing satellite2 Star0)
	(pointing satellite3 GroundStation3)
	(have_image Planet6 image3)
	(have_image Planet6 image6)
	(have_image Planet7 spectrograph4)
	(have_image Planet7 thermograph0)
	(have_image Planet8 image6)
	(have_image Phenomenon9 thermograph5)
	(have_image Phenomenon9 thermograph0)
	(have_image Planet10 spectrograph2)
	(have_image Star11 spectrograph7)
))

)

; plan
1. (turn_to satellite3 groundstation3 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 groundstation3)
   goals met: 1 of 13
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 1 of 13
3. (calibrate satellite3 instrument7 groundstation3)
   added: (calibrated instrument7)
   goals met: 1 of 13
4. (turn_to satellite3 planet7 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet7)
   goals met: 0 of 13
5. (take_image satellite3 planet7 instrument7 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 1 of 13
6. (turn_to satellite3 planet6 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet6)
   goals met: 1 of 13
7. (turn_to satellite2 groundstation3 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 groundstation3)
   goals met: 1 of 13
8. (turn_to satellite1 star5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star5)
   goals met: 1 of 13
9. (turn_to satellite0 groundstation3 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 13
10. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 13
11. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 13
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 13
13. (calibrate satellite2 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 1 of 13
14. (calibrate satellite1 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 1 of 13
15. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 1 of 13
16. (take_image satellite3 planet6 instrument7 image6)
   added: (have_image planet6 image6)
   goals met: 2 of 13
17. (turn_to satellite0 phenomenon9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 13
18. (take_image satellite0 phenomenon9 instrument1 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 3 of 13
19. (turn_to satellite0 planet7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet7)
   goals met: 3 of 13
20. (take_image satellite0 planet7 instrument1 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 4 of 13
21. (turn_to satellite0 star0 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star0)
   goals met: 5 of 13
22. (turn_to satellite1 phenomenon9 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon9)
   goals met: 5 of 13
23. (take_image satellite1 phenomenon9 instrument2 thermograph5)
   added: (have_image phenomenon9 thermograph5)
   goals met: 6 of 13
24. (turn_to satellite1 star11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star11)
   goals met: 6 of 13
25. (take_image satellite1 star11 instrument2 spectrograph7)
   added: (have_image star11 spectrograph7)
   goals met: 7 of 13
26. (turn_to satellite1 groundstation3 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 groundstation3)
   goals met: 8 of 13
27. (turn_to satellite2 planet10 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet10)
   goals met: 8 of 13
28. (take_image satellite2 planet10 instrument4 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 9 of 13
29. (turn_to satellite2 planet6 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet6)
   goals met: 9 of 13
30. (take_image satellite2 planet6 instrument4 image3)
   added: (have_image planet6 image3)
   goals met: 10 of 13
31. (turn_to satellite2 star0 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star0)
   goals met: 11 of 13
32. (turn_to satellite3 planet8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 planet8)
   goals met: 11 of 13
33. (take_image satellite3 planet8 instrument7 image6)
   added: (have_image planet8 image6)
   goals met: 12 of 13
34. (turn_to satellite3 groundstation3 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 groundstation3)
   goals met: 13 of 13
